000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <predefined>
    <items>
      <name>ОптовыеЦены</name>
      <description>Оптовые цены</description>
    </items>
  </predefined>
  <attributes>
    <name>АлгоритмРасчетаЦены</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПередачеМеждуОрганизациями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьВБольшуюСторону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогСрабатывания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаданияЦены</name>
    <type>
      <types>EnumRef.СпособыЗаданияЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>EnumRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВлияющиеВидыЦен</name>
    <attributes>
      <name>ВлияющийВидЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмРасчетаЦены</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаОкругленияЦены</name>
    <attributes>
      <name>НижняяГраницаДиапазонаЦен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочностьОкругления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПсихологическоеОкругление</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПорогиСрабатывания</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорогСрабатывания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ВидыЦен/Forms/РазблокированиеРеквизитов/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	РазрешитьРедактированиеИдентификатор                             = Истина;
	РазрешитьРедактированиеТипЦены                                   = Истина;
	РазрешитьРедактированиеИспользоватьПриПродаже                    = Истина;
	РазрешитьРедактированиеЦенаВключаетНДС                           = Истина;
	РазрешитьРедактированиеСпособЗаданияЦены                         = Истина;
	РазрешитьРедактированиеИспользоватьПриПередачеМеждуОрганизациями = Истина;
	
	РазрешитьРедактированиеПороговСрабатывания                       = Истина;
	РазрешитьРедактированиеПравилОкругленияЦены                      = Истина;
	РазрешитьРедактированиеФормул                                    = Истина;
	РазрешитьРедактированиеСхемыКомпоновкиДанных                     = Истина;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)

	Результат = Новый Массив;
	
	Если РазрешитьРедактированиеТипЦены Тогда
		Результат.Добавить("ТипЦены");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИдентификатор Тогда
		Результат.Добавить("Идентификатор");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИспользоватьПриПродаже Тогда
		Результат.Добавить("ИспользоватьПриПродаже");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИспользоватьПриПередачеМеждуОрганизациями Тогда
		Результат.Добавить("ИспользоватьПриПередачеМеждуОрганизациями");
	КонецЕсли;
	
	Если РазрешитьРедактированиеЦенаВключаетНДС Тогда
		Результат.Добавить("ЦенаВключаетНДС");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСпособЗаданияЦены Тогда
		Результат.Добавить("СпособЗаданияЦены");
	КонецЕсли;
	
	Если РазрешитьРедактированиеПороговСрабатывания Тогда
		Результат.Добавить("ПорогСрабатывания");
		Результат.Добавить("ПорогиСрабатывания");
	КонецЕсли;
	
	Если РазрешитьРедактированиеПравилОкругленияЦены Тогда
		Результат.Добавить("ПравилаОкругленияЦены");
		Результат.Добавить("ОкруглятьВБольшуюСторону");
	КонецЕсли;
	
	Если РазрешитьРедактированиеФормул Тогда
		Результат.Добавить("АлгоритмРасчетаЦены");
		Результат.Добавить("ЦеновыеГруппы");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСхемыКомпоновкиДанных Тогда
		Результат.Добавить("СхемаКомпоновкиДанных");
	КонецЕсли;
	
	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеОтметки(Команда)
	
	РазрешитьРедактированиеИдентификатор                             = Истина;
	РазрешитьРедактированиеТипЦены                                   = Истина;
	РазрешитьРедактированиеИспользоватьПриПродаже                    = Истина;
	РазрешитьРедактированиеЦенаВключаетНДС                           = Истина;
	РазрешитьРедактированиеСпособЗаданияЦены                         = Истина;
	РазрешитьРедактированиеИспользоватьПриПередачеМеждуОрганизациями = Истина;
	РазрешитьРедактированиеСхемыКомпоновкиДанных                     = Истина;
	
	РазрешитьРедактированиеПороговСрабатывания                       = Истина;
	РазрешитьРедактированиеПравилОкругленияЦены                      = Истина;
	РазрешитьРедактированиеФормул                                    = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	
	РазрешитьРедактированиеИдентификатор                             = Ложь;
	РазрешитьРедактированиеТипЦены                                   = Ложь;
	РазрешитьРедактированиеИспользоватьПриПродаже                    = Ложь;
	РазрешитьРедактированиеЦенаВключаетНДС                           = Ложь;
	РазрешитьРедактированиеСпособЗаданияЦены                         = Ложь;
	РазрешитьРедактированиеИспользоватьПриПередачеМеждуОрганизациями = Ложь;
	РазрешитьРедактированиеСхемыКомпоновкиДанных                     = Ложь;
	
	РазрешитьРедактированиеПороговСрабатывания                       = Ложь;
	РазрешитьРедактированиеПравилОкругленияЦены                      = Ложь;
	РазрешитьРедактированиеФормул                                    = Ложь;
	
КонецПроцедуры
